Tekla.Structures.Analysis.Remoting.AnalysisDelegateProxy
CDelegate remote class proxy.

Tekla.Structures.Analysis.Remoting.AnalysisDelegateProxy.Instance
The remote delegate object.

Tekla.Structures.Analysis.Remoting.AnalysisDelegateProxy.#cctor
Initializes static instance variable.

Tekla.Structures.Analysis.Remoting.AnalysisDelegateProxy.Delegate
Gets the singleton CDelegate instance that includes model API methods.